tobliao/Microchip-Projects-MASTER-2025/intro/src/packs/PIC32CM3204GV00032_DFP/pic32cm3204gv00032.h
/*
 * Header file for PIC32CM3204GV00032
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2019-11-25T23:26:13Z */
#ifndef _PIC32CM3204GV00032_H_
#define _PIC32CM3204GV00032_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.1"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (1)

/* PIC32CM3204GV00032 definitions
  This file defines all structures and symbols for PIC32CM3204GV00032:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/*                  CMSIS DEFINITIONS FOR PIC32CM3204GV00032                  */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M0PLUS Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/* ************* PIC32CM3204GV00032 specific Interrupt Numbers ************** */
  PM_IRQn                   =   0, /* 0   Power Manager (PM)                  */
  SYSCTRL_IRQn              =   1, /* 1   System Control (SYSCTRL)            */
  WDT_IRQn                  =   2, /* 2   Watchdog Timer (WDT)                */
  RTC_IRQn                  =   3, /* 3   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   4, /* 4   External Interrupt Controller (EIC) */
  NVMCTRL_IRQn              =   5, /* 5   Non-Volatile Memory Controller (NVMCTRL) */
  EVSYS_IRQn                =   6, /* 6   Event System Interface (EVSYS)      */
  SERCOM0_IRQn              =   7, /* 7   Serial Communication Interface (SERCOM0) */
  SERCOM1_IRQn              =   8, /* 8   Serial Communication Interface (SERCOM1) */
  SERCOM2_IRQn              =   9, /* 9   Serial Communication Interface (SERCOM2) */
  SERCOM3_IRQn              =  10, /* 10  Serial Communication Interface (SERCOM3) */
  TC0_IRQn                  =  13, /* 13  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  14, /* 14  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  15, /* 15  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  16, /* 16  Basic Timer Counter (TC3)           */
  TC4_IRQn                  =  17, /* 17  Basic Timer Counter (TC4)           */
  TC5_IRQn                  =  18, /* 18  Basic Timer Counter (TC5)           */
  ADC_IRQn                  =  21, /* 21  Analog Digital Converter (ADC)      */
  AC_IRQn                   =  22, /* 22  Analog Comparators (AC)             */
  DAC_IRQn                  =  23, /* 23  Digital Analog Converter (DAC)      */
  PTC_IRQn                  =  24, /* 24  Peripheral Touch Controller (PTC)   */

  PERIPH_MAX_IRQn           =  24  /* Max peripheral ID */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M0PLUS handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnPM_Handler;                           /*   0 Power Manager (PM) */
  void* pfnSYSCTRL_Handler;                      /*   1 System Control (SYSCTRL) */
  void* pfnWDT_Handler;                          /*   2 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*   3 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   4 External Interrupt Controller (EIC) */
  void* pfnNVMCTRL_Handler;                      /*   5 Non-Volatile Memory Controller (NVMCTRL) */
  void* pfnEVSYS_Handler;                        /*   6 Event System Interface (EVSYS) */
  void* pfnSERCOM0_Handler;                      /*   7 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*   8 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_Handler;                      /*   9 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_Handler;                      /*  10 Serial Communication Interface (SERCOM3) */
  void* pvReserved11;
  void* pvReserved12;
  void* pfnTC0_Handler;                          /*  13 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  14 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  15 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  16 Basic Timer Counter (TC3) */
  void* pfnTC4_Handler;                          /*  17 Basic Timer Counter (TC4) */
  void* pfnTC5_Handler;                          /*  18 Basic Timer Counter (TC5) */
  void* pvReserved19;
  void* pvReserved20;
  void* pfnADC_Handler;                          /*  21 Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  22 Analog Comparators (AC) */
  void* pfnDAC_Handler;                          /*  23 Digital Analog Converter (DAC) */
  void* pfnPTC_Handler;                          /*  24 Peripheral Touch Controller (PTC) */
} DeviceVectors;

